/**
⢀⣀⠀⠀⠀⠰⣶⡖⠲⠦⠤⣿⣝⠲⣤⣄⡀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠸⣿⡉⠛⣒⠲⠾⡟⠓⠒⠲⡾⢿⣿⢿⡦⣍⠻⣷⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠹⣟⢄⡈⠙⠢⠤⣀⣀⣀⣙⣦⣙⠻⢦⣌⡳⠄⣿⣮⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⣿⡷⣝⡢⠄⢰⡚⠛⠓⠒⠤⠬⣿⡶⠬⡅⠘⢿⣷⠀⣻⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠹⣗⣤⣽⡦⠄⠙⢦⣀⠀⠀⠀⢻⠘⣆⢰⣒⣦⣤⣼⣍⡿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠈⠙⣿⢯⣔⣒⣀⣈⠿⠒⣀⡤⠒⠋⠉⠁⠀⠀⠀⠉⣿⡘⢦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠿⠷⢶⡞⠋⠉⢩⠤⠞⠁⠀⠀⠀⢀⣀⣤⠤⠲⣞⣿⣷⠸⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢸⣿⣀⣀⣀⣠⠤⠤⠖⢒⣿⠿⠟⠛⠂⠀⢹⣿⣿⠀⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠸⣿⣻⡠⠤⣤⣴⣦⡀⠉⠁⠴⣿⠟⠀⠀⠀⣿⠏⠀⠀⠑⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⢻⣿⣇⠀⠛⠛⠁⣇⣀⣤⡤⠤⠤⠤⢰⡾⠃⠀⠀⢀⣀⡈⢣⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣤⡤⠖⣫⠵⢷⠚⠛⢻⠉⣹⠋⠀⣠⠔⢊⣁⡤⠤⠌⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣷⠚⠉⢱⠀⠸⡄⠀⣠⠟⠁⠴⣫⠔⠊⠁⠀⠀⠀⠀⠈⢦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣇⠀⠀⠇⠀⣱⠞⠁⠀⡠⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠳⣄⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⡿⣆⠀⢠⠞⠁⠀⡠⠊⠀⠀⠀⠀⠀⠀⢀⣀⣠⣤⠤⠔⠒⠚⠓⠒⠤⣄⡀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⡿⠁⠈⡶⠃⢀⡴⠊⠀⠀⠀⠀⠀⣠⠴⠚⠉⣠⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢆⠀⠀
⠀⠀⠀⠀⠀⠀⢰⣿⣿⠟⠀⢀⠞⠁⠐⠋⠀⠀⠀⠀⣠⢴⡎⠁⠀⠀⡴⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢧⠀
⠀⠀⠀⠀⠀⠀⠈⢿⡇⠀⢠⣏⣠⠞⠀⠀⠀⢀⡴⠊⠁⠀⠳⠀⢀⡜⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⡇
⠀⠀⠀⠀⠀⠀⠀⠘⣷⠀⠸⠈⠀⠀⢀⡤⠖⠉⠀⣠⠆⠀⠀⢀⡞⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇
⠀⠀⠀⠀⠀⢀⡴⠋⢹⣆⣀⣠⣤⠒⠙⡇⣠⠔⠋⠀⠀⠀⠀⣸⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇
⠀⠀⠀⠀⠀⡞⠀⢀⠼⡇⢰⣾⣿⣷⡴⣟⠁⠀⠀⠀⠀⠀⣰⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇
⠀⠀⠀⠀⠀⣇⡴⢁⡴⣇⣨⣼⣿⠋⠀⠈⠀⠀⠀⠀⢀⡼⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠃
⠀⠀⠀⠀⠀⠉⠀⠈⠀⠈⠀⠀⠉⠀⠀⠀⠀⠀⠀⠀⠈⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
 Copyright (C) 2023
 Licensed under the  GPL-3.0 License;
 You may not use this file except in compliance with the License.
 It is supplied in the hope that it may be useful.
 * @project_name : Dark Nero V9
 * @description : Dark Nero V9,A Multi-functional whatsapp bot.
 **/

const _0x425dec=_0x1fa5;(function(_0x5cc100,_0xd97c5d){const _0x130ebc=_0x1fa5,_0x23db82=_0x5cc100();while(!![]){try{const _0x50abba=parseInt(_0x130ebc(0xe4))/0x1*(-parseInt(_0x130ebc(0xee))/0x2)+parseInt(_0x130ebc(0xd9))/0x3*(parseInt(_0x130ebc(0xec))/0x4)+-parseInt(_0x130ebc(0xd5))/0x5+-parseInt(_0x130ebc(0xd3))/0x6*(-parseInt(_0x130ebc(0xd4))/0x7)+parseInt(_0x130ebc(0xe2))/0x8*(-parseInt(_0x130ebc(0xcb))/0x9)+-parseInt(_0x130ebc(0xd8))/0xa*(parseInt(_0x130ebc(0xd7))/0xb)+parseInt(_0x130ebc(0xe3))/0xc*(parseInt(_0x130ebc(0xdc))/0xd);if(_0x50abba===_0xd97c5d)break;else _0x23db82['push'](_0x23db82['shift']());}catch(_0x4af2c9){_0x23db82['push'](_0x23db82['shift']());}}}(_0x1759,0x55c4f));const {tlang,botpic,cmd,prefix,runtime,Config,formatp,fetchJson}=require(_0x425dec(0xe8)),Esana=require(_0x425dec(0xcf));var api=new Esana();function _0x1759(){const _0x2abcbe=['reply','news_id','129752XMdwaG','24CPBKdP','8SivTql','PUBLISHED','results','downloader','../lib','<wbi>','sendMessage','whatsapp\x20beta\x20infomation.','784968FIBlvL','🗞️','132764OIdDHK','❗\x20*','DESCRIPTION','COVER','378sEMfJR','latest_id','\x0a*_|:̵🤹‍♂️⃟⃪♥️̟⎝⃝࿐ᴇꜱᴀɴᴀ\x20ɴᴇᴡꜱ_*\x20\x0a\x0a📃⃕⃕⃟⃫🥷\x20ᴛɪᴛᴇʟ\x20:\x20\x20','esana','@sl-code-lords/esana-news','\x0a\x0a*┗━━━━━━━━━━━━━━◆*\x0a\x0a\x20©ᴅᴇᴠᴇʟᴏᴘᴇᴅ\x20ʙʏ\x20ᴄʏʙᴇʀ\x20ʏᴀᴋᴜᴢᴀ\x20ᴛᴇᴀᴍ','news','\x0a\x0a📃⃫⃕⃟🥷\x20ᴜʀʟ\x20:\x20','243786nhuqiq','14vqTyrQ','510390RZQuYx','esananews','551749shguHF','50NhVFVJ','3OnFnBm','\x0a\x0a📃⃫⃕⃟🥷\x20ᴅᴀᴛᴇ\x20&\x20ᴛɪᴍᴇ\x20:\x20\x20','key','10653071csCaOk','TITLE','log','chat'];_0x1759=function(){return _0x2abcbe;};return _0x1759();}function _0x1fa5(_0x43b19e,_0x437740){const _0x175905=_0x1759();return _0x1fa5=function(_0x1fa531,_0x19be92){_0x1fa531=_0x1fa531-0xc8;let _0x11a5d5=_0x175905[_0x1fa531];return _0x11a5d5;},_0x1fa5(_0x43b19e,_0x437740);}cmd({'pattern':_0x425dec(0xce),'alias':[_0x425dec(0xd6),_0x425dec(0xd1)],'desc':_0x425dec(0xeb),'category':_0x425dec(0xe7),'react':_0x425dec(0xed),'use':_0x425dec(0xe9)},async(_0x4ac6b9,_0x6fd753,_0x71cdd9)=>{const _0x38bc5b=_0x425dec;try{const _0x2a6972=await api[_0x38bc5b(0xcc)](),_0x4a8a33=_0x2a6972[_0x38bc5b(0xe6)][_0x38bc5b(0xe1)];let _0x526d83=_0x71cdd9||_0x4a8a33;const _0x20a9a9=await api[_0x38bc5b(0xd1)](_0x526d83),_0x25c740=_0x20a9a9[_0x38bc5b(0xe6)],_0xc84f30=await _0x4ac6b9[_0x38bc5b(0xea)](_0x6fd753['chat'],{'image':{'url':_0x25c740[_0x38bc5b(0xca)]},'caption':_0x38bc5b(0xcd)+_0x25c740[_0x38bc5b(0xdd)]+_0x38bc5b(0xda)+_0x25c740[_0x38bc5b(0xe5)]+_0x38bc5b(0xd2)+_0x25c740['URL']+'\x0a\x0a📃⃫⃕⃟🥷\x20ᴅᴇꜱᴄʀɪᴘᴛɪᴏɴ\x20:\x20'+_0x25c740[_0x38bc5b(0xc9)]+_0x38bc5b(0xd0)},{'quoted':_0x6fd753});await _0x4ac6b9[_0x38bc5b(0xea)](_0x6fd753[_0x38bc5b(0xdf)],{'react':{'text':'📰','key':_0xc84f30[_0x38bc5b(0xdb)]}});}catch(_0x33fd38){console[_0x38bc5b(0xde)](_0x33fd38),_0x6fd753[_0x38bc5b(0xe0)](_0x38bc5b(0xc8)+_0x33fd38+'*');}});
