/**
⢀⣀⠀⠀⠀⠰⣶⡖⠲⠦⠤⣿⣝⠲⣤⣄⡀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠸⣿⡉⠛⣒⠲⠾⡟⠓⠒⠲⡾⢿⣿⢿⡦⣍⠻⣷⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠹⣟⢄⡈⠙⠢⠤⣀⣀⣀⣙⣦⣙⠻⢦⣌⡳⠄⣿⣮⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⣿⡷⣝⡢⠄⢰⡚⠛⠓⠒⠤⠬⣿⡶⠬⡅⠘⢿⣷⠀⣻⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠹⣗⣤⣽⡦⠄⠙⢦⣀⠀⠀⠀⢻⠘⣆⢰⣒⣦⣤⣼⣍⡿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠈⠙⣿⢯⣔⣒⣀⣈⠿⠒⣀⡤⠒⠋⠉⠁⠀⠀⠀⠉⣿⡘⢦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠿⠷⢶⡞⠋⠉⢩⠤⠞⠁⠀⠀⠀⢀⣀⣤⠤⠲⣞⣿⣷⠸⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢸⣿⣀⣀⣀⣠⠤⠤⠖⢒⣿⠿⠟⠛⠂⠀⢹⣿⣿⠀⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠸⣿⣻⡠⠤⣤⣴⣦⡀⠉⠁⠴⣿⠟⠀⠀⠀⣿⠏⠀⠀⠑⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⢻⣿⣇⠀⠛⠛⠁⣇⣀⣤⡤⠤⠤⠤⢰⡾⠃⠀⠀⢀⣀⡈⢣⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣤⡤⠖⣫⠵⢷⠚⠛⢻⠉⣹⠋⠀⣠⠔⢊⣁⡤⠤⠌⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣷⠚⠉⢱⠀⠸⡄⠀⣠⠟⠁⠴⣫⠔⠊⠁⠀⠀⠀⠀⠈⢦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣇⠀⠀⠇⠀⣱⠞⠁⠀⡠⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠳⣄⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⡿⣆⠀⢠⠞⠁⠀⡠⠊⠀⠀⠀⠀⠀⠀⢀⣀⣠⣤⠤⠔⠒⠚⠓⠒⠤⣄⡀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⡿⠁⠈⡶⠃⢀⡴⠊⠀⠀⠀⠀⠀⣠⠴⠚⠉⣠⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢆⠀⠀
⠀⠀⠀⠀⠀⠀⢰⣿⣿⠟⠀⢀⠞⠁⠐⠋⠀⠀⠀⠀⣠⢴⡎⠁⠀⠀⡴⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢧⠀
⠀⠀⠀⠀⠀⠀⠈⢿⡇⠀⢠⣏⣠⠞⠀⠀⠀⢀⡴⠊⠁⠀⠳⠀⢀⡜⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⡇
⠀⠀⠀⠀⠀⠀⠀⠘⣷⠀⠸⠈⠀⠀⢀⡤⠖⠉⠀⣠⠆⠀⠀⢀⡞⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇
⠀⠀⠀⠀⠀⢀⡴⠋⢹⣆⣀⣠⣤⠒⠙⡇⣠⠔⠋⠀⠀⠀⠀⣸⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇
⠀⠀⠀⠀⠀⡞⠀⢀⠼⡇⢰⣾⣿⣷⡴⣟⠁⠀⠀⠀⠀⠀⣰⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇
⠀⠀⠀⠀⠀⣇⡴⢁⡴⣇⣨⣼⣿⠋⠀⠈⠀⠀⠀⠀⢀⡼⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠃
⠀⠀⠀⠀⠀⠉⠀⠈⠀⠈⠀⠀⠉⠀⠀⠀⠀⠀⠀⠀⠈⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
 Copyright (C) 2023
 Licensed under the  GPL-3.0 License;
 You may not use this file except in compliance with the License.
 It is supplied in the hope that it may be useful.
 * @project_name : Dark Nero V9
 * @description : Dark Nero V9,A Multi-functional whatsapp bot.
 **/

function _0x35c0(_0x56e445,_0x4fde22){const _0x593945=_0x5939();return _0x35c0=function(_0x35c0f7,_0x2ae15c){_0x35c0f7=_0x35c0f7-0x116;let _0x446e5d=_0x593945[_0x35c0f7];return _0x446e5d;},_0x35c0(_0x56e445,_0x4fde22);}const _0x19d271=_0x35c0;(function(_0x21c359,_0x46151b){const _0x268dcc=_0x35c0,_0x470e4d=_0x21c359();while(!![]){try{const _0x3b233c=-parseInt(_0x268dcc(0x122))/0x1*(-parseInt(_0x268dcc(0x11b))/0x2)+-parseInt(_0x268dcc(0x121))/0x3+-parseInt(_0x268dcc(0x123))/0x4*(parseInt(_0x268dcc(0x116))/0x5)+-parseInt(_0x268dcc(0x124))/0x6*(-parseInt(_0x268dcc(0x12e))/0x7)+parseInt(_0x268dcc(0x125))/0x8*(-parseInt(_0x268dcc(0x12a))/0x9)+parseInt(_0x268dcc(0x11d))/0xa+parseInt(_0x268dcc(0x126))/0xb;if(_0x3b233c===_0x46151b)break;else _0x470e4d['push'](_0x470e4d['shift']());}catch(_0x52f2af){_0x470e4d['push'](_0x470e4d['shift']());}}}(_0x5939,0x67209));const {cmd}=require(_0x19d271(0x128)),hirunews=require(_0x19d271(0x129));cmd({'pattern':_0x19d271(0x118),'category':'hiru','react':'📰','filename':__filename},async(_0x12a653,_0x4199b2,_0x8ee59b)=>{const _0x54597a=_0x19d271,_0x505231=await hirunews(),_0x3d7262=_0x54597a(0x12d)+_0x505231[_0x54597a(0x120)][_0x54597a(0x11e)]+'\x0a\x0a📃⃫⃕⃟🥷\x20ᴅᴀᴛᴇ\x20&\x20ᴛɪᴍᴇ\x20:\x20\x20'+_0x505231[_0x54597a(0x120)][_0x54597a(0x119)]+_0x54597a(0x12b)+_0x505231[_0x54597a(0x120)][_0x54597a(0x117)]+_0x54597a(0x11a)+_0x505231[_0x54597a(0x120)]['description']+_0x54597a(0x11c);await _0x12a653[_0x54597a(0x11f)](_0x4199b2[_0x54597a(0x12c)],{'image':{'url':_0x505231[_0x54597a(0x120)][_0x54597a(0x127)]},'caption':_0x3d7262},{'quoted':_0x4199b2});});function _0x5939(){const _0x23cd96=['sendMessage','result','2265414EfsEly','69193CVEqYN','32CEsErX','126WYbzPf','128iOAFZg','3731310XBEGgb','image','../lib','hirunews-scraper','363177mKdXbD','\x0a\x0a📃⃫⃕⃟🥷\x20ᴜʀʟ\x20:\x20','chat','*_|:̵🤹‍♂️⃟⃪♥️̟⎝⃝࿐ʜɪʀᴜ\x20ɴᴇᴡꜱ_*\x20\x0a\x0a📃⃕⃕⃟⃫🥷\x20ᴛɪᴛᴇʟ\x20:\x20\x20','270907iVmcIP','127770uUtpST','link','hirunews','dateandtime','\x0a\x0a📃⃫⃕⃟🥷\x20ᴅᴇꜱᴄʀɪᴘᴛɪᴏɴ\x20:\x20','2ebDXCA','\x0a\x0a*┗━━━━━━━━━━━━━━◆*\x0a\x0a\x20©ᴅᴇᴠᴇʟᴏᴘᴇᴅ\x20ʙʏ\x20ᴄʏʙᴇʀ\x20ʏᴀᴋᴜᴢᴀ\x20ᴛᴇᴀᴍ','8065030FugIZh','title'];_0x5939=function(){return _0x23cd96;};return _0x5939();}
