/**
⢀⣀⠀⠀⠀⠰⣶⡖⠲⠦⠤⣿⣝⠲⣤⣄⡀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠸⣿⡉⠛⣒⠲⠾⡟⠓⠒⠲⡾⢿⣿⢿⡦⣍⠻⣷⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠹⣟⢄⡈⠙⠢⠤⣀⣀⣀⣙⣦⣙⠻⢦⣌⡳⠄⣿⣮⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⣿⡷⣝⡢⠄⢰⡚⠛⠓⠒⠤⠬⣿⡶⠬⡅⠘⢿⣷⠀⣻⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠹⣗⣤⣽⡦⠄⠙⢦⣀⠀⠀⠀⢻⠘⣆⢰⣒⣦⣤⣼⣍⡿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠈⠙⣿⢯⣔⣒⣀⣈⠿⠒⣀⡤⠒⠋⠉⠁⠀⠀⠀⠉⣿⡘⢦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠿⠷⢶⡞⠋⠉⢩⠤⠞⠁⠀⠀⠀⢀⣀⣤⠤⠲⣞⣿⣷⠸⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢸⣿⣀⣀⣀⣠⠤⠤⠖⢒⣿⠿⠟⠛⠂⠀⢹⣿⣿⠀⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠸⣿⣻⡠⠤⣤⣴⣦⡀⠉⠁⠴⣿⠟⠀⠀⠀⣿⠏⠀⠀⠑⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⢻⣿⣇⠀⠛⠛⠁⣇⣀⣤⡤⠤⠤⠤⢰⡾⠃⠀⠀⢀⣀⡈⢣⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣤⡤⠖⣫⠵⢷⠚⠛⢻⠉⣹⠋⠀⣠⠔⢊⣁⡤⠤⠌⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣷⠚⠉⢱⠀⠸⡄⠀⣠⠟⠁⠴⣫⠔⠊⠁⠀⠀⠀⠀⠈⢦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣇⠀⠀⠇⠀⣱⠞⠁⠀⡠⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠳⣄⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⡿⣆⠀⢠⠞⠁⠀⡠⠊⠀⠀⠀⠀⠀⠀⢀⣀⣠⣤⠤⠔⠒⠚⠓⠒⠤⣄⡀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⡿⠁⠈⡶⠃⢀⡴⠊⠀⠀⠀⠀⠀⣠⠴⠚⠉⣠⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢆⠀⠀
⠀⠀⠀⠀⠀⠀⢰⣿⣿⠟⠀⢀⠞⠁⠐⠋⠀⠀⠀⠀⣠⢴⡎⠁⠀⠀⡴⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢧⠀
⠀⠀⠀⠀⠀⠀⠈⢿⡇⠀⢠⣏⣠⠞⠀⠀⠀⢀⡴⠊⠁⠀⠳⠀⢀⡜⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⡇
⠀⠀⠀⠀⠀⠀⠀⠘⣷⠀⠸⠈⠀⠀⢀⡤⠖⠉⠀⣠⠆⠀⠀⢀⡞⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇
⠀⠀⠀⠀⠀⢀⡴⠋⢹⣆⣀⣠⣤⠒⠙⡇⣠⠔⠋⠀⠀⠀⠀⣸⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇
⠀⠀⠀⠀⠀⡞⠀⢀⠼⡇⢰⣾⣿⣷⡴⣟⠁⠀⠀⠀⠀⠀⣰⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇
⠀⠀⠀⠀⠀⣇⡴⢁⡴⣇⣨⣼⣿⠋⠀⠈⠀⠀⠀⠀⢀⡼⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠃
⠀⠀⠀⠀⠀⠉⠀⠈⠀⠈⠀⠀⠉⠀⠀⠀⠀⠀⠀⠀⠈⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
 Copyright (C) 2023
 Licensed under the  GPL-3.0 License;
 You may not use this file except in compliance with the License.
 It is supplied in the hope that it may be useful.
 * @project_name : Dark Nero V9
 * @description : Dark Nero V9,A Multi-functional whatsapp bot.
 **/

//---------------------------------------------------------------------------
const _0x445205=_0x5e05;function _0x5e05(_0x4b7f56,_0xe599f4){const _0x5ea2ff=_0x5ea2();return _0x5e05=function(_0x5e05ae,_0x45ff55){_0x5e05ae=_0x5e05ae-0x1cf;let _0x3e642d=_0x5ea2ff[_0x5e05ae];return _0x3e642d;},_0x5e05(_0x4b7f56,_0xe599f4);}(function(_0x5db597,_0x35ccf4){const _0x33ce27=_0x5e05,_0x5de1c4=_0x5db597();while(!![]){try{const _0x42c91b=parseInt(_0x33ce27(0x1d3))/0x1*(-parseInt(_0x33ce27(0x1da))/0x2)+-parseInt(_0x33ce27(0x1d5))/0x3*(parseInt(_0x33ce27(0x1dd))/0x4)+-parseInt(_0x33ce27(0x1df))/0x5*(-parseInt(_0x33ce27(0x1d6))/0x6)+parseInt(_0x33ce27(0x1d7))/0x7+-parseInt(_0x33ce27(0x1e1))/0x8*(parseInt(_0x33ce27(0x1d2))/0x9)+-parseInt(_0x33ce27(0x1db))/0xa+parseInt(_0x33ce27(0x1e2))/0xb;if(_0x42c91b===_0x35ccf4)break;else _0x5de1c4['push'](_0x5de1c4['shift']());}catch(_0x300742){_0x5de1c4['push'](_0x5de1c4['shift']());}}}(_0x5ea2,0xc8f1c));function _0x5ea2(){const _0x37529e=['To\x20check\x20ping','2637wFsKnW','728zAULnJ','cmd','556707zhdopm','24THtqgZ','4629751OtURlP','getTime','ᴍꜱ*\x20','244fxpPix','16232730PsvMVl','*|:̵🤹‍♂️⃟⃪♥️̟⎝⃝࿐ᴅᴀʀᴋ\x20ɴᴇʀᴏ\x20ᴘᴏɴɢ*\x0a\x20*','12KOCpCd','sendMessage','2024905FVCkGO','ping','34744jkfadh','22913506jbFevw','general','chat'];_0x5ea2=function(){return _0x37529e;};return _0x5ea2();}const Secktor=require('../lib');Secktor[_0x445205(0x1d4)]({'pattern':_0x445205(0x1e0),'alias':['2'],'react':'⚡','desc':_0x445205(0x1d1),'category':_0x445205(0x1cf),'filename':__filename},async(_0x23dfbe,_0xf2de4b)=>{const _0x5967d7=_0x445205;var _0x8caaee=new Date()[_0x5967d7(0x1d8)]();const {key:_0x37edf0}=await _0x23dfbe[_0x5967d7(0x1de)](_0xf2de4b[_0x5967d7(0x1d0)],{'text':'```\x20⚡ᴾᴸᴱᴬˢᴱ\x20ᵂᴬᴵᵀᴵᴺᴳ...⚡```'});var _0x3b9d34=new Date()[_0x5967d7(0x1d8)]();return await _0x23dfbe[_0x5967d7(0x1de)](_0xf2de4b[_0x5967d7(0x1d0)],{'text':_0x5967d7(0x1dc)+(_0x3b9d34-_0x8caaee)+_0x5967d7(0x1d9),'edit':_0x37edf0});});
