/**
⢀⣀⠀⠀⠀⠰⣶⡖⠲⠦⠤⣿⣝⠲⣤⣄⡀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠸⣿⡉⠛⣒⠲⠾⡟⠓⠒⠲⡾⢿⣿⢿⡦⣍⠻⣷⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠹⣟⢄⡈⠙⠢⠤⣀⣀⣀⣙⣦⣙⠻⢦⣌⡳⠄⣿⣮⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⣿⡷⣝⡢⠄⢰⡚⠛⠓⠒⠤⠬⣿⡶⠬⡅⠘⢿⣷⠀⣻⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠹⣗⣤⣽⡦⠄⠙⢦⣀⠀⠀⠀⢻⠘⣆⢰⣒⣦⣤⣼⣍⡿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠈⠙⣿⢯⣔⣒⣀⣈⠿⠒⣀⡤⠒⠋⠉⠁⠀⠀⠀⠉⣿⡘⢦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠿⠷⢶⡞⠋⠉⢩⠤⠞⠁⠀⠀⠀⢀⣀⣤⠤⠲⣞⣿⣷⠸⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢸⣿⣀⣀⣀⣠⠤⠤⠖⢒⣿⠿⠟⠛⠂⠀⢹⣿⣿⠀⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠸⣿⣻⡠⠤⣤⣴⣦⡀⠉⠁⠴⣿⠟⠀⠀⠀⣿⠏⠀⠀⠑⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⢻⣿⣇⠀⠛⠛⠁⣇⣀⣤⡤⠤⠤⠤⢰⡾⠃⠀⠀⢀⣀⡈⢣⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣤⡤⠖⣫⠵⢷⠚⠛⢻⠉⣹⠋⠀⣠⠔⢊⣁⡤⠤⠌⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣷⠚⠉⢱⠀⠸⡄⠀⣠⠟⠁⠴⣫⠔⠊⠁⠀⠀⠀⠀⠈⢦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣇⠀⠀⠇⠀⣱⠞⠁⠀⡠⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠳⣄⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⡿⣆⠀⢠⠞⠁⠀⡠⠊⠀⠀⠀⠀⠀⠀⢀⣀⣠⣤⠤⠔⠒⠚⠓⠒⠤⣄⡀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⡿⠁⠈⡶⠃⢀⡴⠊⠀⠀⠀⠀⠀⣠⠴⠚⠉⣠⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢆⠀⠀
⠀⠀⠀⠀⠀⠀⢰⣿⣿⠟⠀⢀⠞⠁⠐⠋⠀⠀⠀⠀⣠⢴⡎⠁⠀⠀⡴⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢧⠀
⠀⠀⠀⠀⠀⠀⠈⢿⡇⠀⢠⣏⣠⠞⠀⠀⠀⢀⡴⠊⠁⠀⠳⠀⢀⡜⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⡇
⠀⠀⠀⠀⠀⠀⠀⠘⣷⠀⠸⠈⠀⠀⢀⡤⠖⠉⠀⣠⠆⠀⠀⢀⡞⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇
⠀⠀⠀⠀⠀⢀⡴⠋⢹⣆⣀⣠⣤⠒⠙⡇⣠⠔⠋⠀⠀⠀⠀⣸⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇
⠀⠀⠀⠀⠀⡞⠀⢀⠼⡇⢰⣾⣿⣷⡴⣟⠁⠀⠀⠀⠀⠀⣰⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇
⠀⠀⠀⠀⠀⣇⡴⢁⡴⣇⣨⣼⣿⠋⠀⠈⠀⠀⠀⠀⢀⡼⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠃
⠀⠀⠀⠀⠀⠉⠀⠈⠀⠈⠀⠀⠉⠀⠀⠀⠀⠀⠀⠀⠈⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
 Copyright (C) 2023
 Licensed under the  GPL-3.0 License;
 You may not use this file except in compliance with the License.
 It is supplied in the hope that it may be useful.
 * @project_name : Dark Nero V9
 * @description : Dark Nero V9,A Multi-functional whatsapp bot.
 **/

const _0x392d70=_0x5f15;function _0x5f15(_0x1d8b7d,_0x86623e){const _0x221888=_0x2218();return _0x5f15=function(_0x5f1507,_0x2e77db){_0x5f1507=_0x5f1507-0xe6;let _0x430ff7=_0x221888[_0x5f1507];return _0x430ff7;},_0x5f15(_0x1d8b7d,_0x86623e);}(function(_0x4ad939,_0x386a3f){const _0xc16e3c=_0x5f15,_0x3ae4eb=_0x4ad939();while(!![]){try{const _0x12ce41=-parseInt(_0xc16e3c(0xf8))/0x1*(-parseInt(_0xc16e3c(0xef))/0x2)+-parseInt(_0xc16e3c(0xf6))/0x3*(-parseInt(_0xc16e3c(0xed))/0x4)+parseInt(_0xc16e3c(0xf4))/0x5*(parseInt(_0xc16e3c(0xf3))/0x6)+-parseInt(_0xc16e3c(0xe7))/0x7*(parseInt(_0xc16e3c(0xf2))/0x8)+parseInt(_0xc16e3c(0xea))/0x9+-parseInt(_0xc16e3c(0xfd))/0xa*(-parseInt(_0xc16e3c(0xfe))/0xb)+-parseInt(_0xc16e3c(0xf0))/0xc*(parseInt(_0xc16e3c(0xf9))/0xd);if(_0x12ce41===_0x386a3f)break;else _0x3ae4eb['push'](_0x3ae4eb['shift']());}catch(_0x1a2b7b){_0x3ae4eb['push'](_0x3ae4eb['shift']());}}}(_0x2218,0x6e0ca));const {cmd}=require('../lib'),sirasanews=require(_0x392d70(0xfa));function _0x2218(){const _0x5dcaf1=['chat','44cELFyS','192TrNcSP','link','104QipqWp','372DSVzWx','69610XAMhyn','title','18kbuqlr','dateandtime','39279SUxkiI','1833884PcKWqb','sirasa-news','\x0a\x0a📃⃫⃕⃟🥷\x20ᴅᴀᴛᴇ\x20&\x20ᴛɪᴍᴇ\x20:\x20','result','40lxAZBf','372559mcHEbP','sirasa','220367saXqet','*_|:̵🤹‍♂️⃟⃪♥️̟⎝⃝࿐ꜱɪʀᴀꜱᴀ\x20ɴᴇᴡꜱ_*\x20\x0a\x20\x20\x20\x20\x0a📃⃕⃕⃟⃫🥷\x20ᴛɪᴛᴇʟ\x20:\x20\x20','\x0a*┗━━━━━━━━━━━━━━◆*\x0a\x0a\x20©ᴅᴇᴠᴇʟᴏᴘᴇᴅ\x20ʙʏ\x20ᴄʏʙᴇʀ\x20ʏᴀᴋᴜᴢᴀ\x20ᴛᴇᴀᴍ','6057837qahTgw','\x0a\x0a📃⃫⃕⃟🥷\x20ᴜʀʟ\x20:\x20','description','387488qzbIbe'];_0x2218=function(){return _0x5dcaf1;};return _0x2218();}cmd({'pattern':_0x392d70(0xe6),'category':'news','react':'🗞','filename':__filename},async(_0x49f25a,_0x547cd2,_0x52d982)=>{const _0x532d5e=_0x392d70,_0x17e263=await sirasanews(),_0x363e01=_0x532d5e(0xe8)+_0x17e263['result'][_0x532d5e(0xf5)]+_0x532d5e(0xfb)+_0x17e263[_0x532d5e(0xfc)][_0x532d5e(0xf7)]+'\x0a\x0a📃⃫⃕⃟🥷\x20ᴅᴇꜱᴄʀɪᴘᴛɪᴏɴ\x20:\x20'+_0x17e263[_0x532d5e(0xfc)][_0x532d5e(0xec)]+_0x532d5e(0xeb)+_0x17e263[_0x532d5e(0xfc)][_0x532d5e(0xf1)]+_0x532d5e(0xe9);await _0x49f25a['sendMessage'](_0x547cd2[_0x532d5e(0xee)],{'image':{'url':_0x17e263['result']['image']},'caption':_0x363e01},{'quoted':_0x547cd2});});
